package main

import (
	"fmt"
	"log"
)

/*
Вася делает тест по математике: вычисляет значение функций в различных точках. Стоит отличная погода, и друзья зовут Васю гулять. Но мальчик решил сначала закончить тест и только после этого идти к друзьям. К сожалению, Вася пока не умеет программировать. Зато вы умеете. Помогите Васе написать код функции, вычисляющей y = ax2 + bx + c. Напишите программу, которая будет по коэффициентам a, b, c и числу x выводить значение функции в точке x.

Формат ввода
На вход через пробел подаются целые числа a, x, b, c. В конце ввода находится перенос строки.

Формат вывода
Выведите одно число — значение функции в точке x.

Пример 1
Ввод	Вывод
-8 -5 -2 7
-183
Пример 2
Ввод	Вывод
8 2 9 -10
40
*/

func main() {
	var a, x, b, c int
	_, err := fmt.Scanln(&a, &x, &b, &c)
	if err != nil {
		log.Fatal(err)
	}
	fmt.Print(a*x*x + b*x + c)
}
